{
  "posts": [
    {
      "id": 1,
      "title": "json-server",
      "body": "json-server is a simple way to create a REST API with JSON data."
    },
    {
      "id": 2,
      "title": "react-query",
      "body": "react-query is a powerful data-fetching library for React applications."
    },
    {
      "id": 3,
      "title": "next.js",
      "body": "Next.js is a React framework that enables server-side rendering and static site generation."
    },
    {
      "id": 4,
      "title": "firebase",
      "body": "Firebase is a platform developed by Google for creating mobile and web applications."
    },
    {
      "id": 5,
      "title": "node.js",
      "body": "Node.js is a JavaScript runtime built on Chrome's V8 JavaScript engine."
    },
    {
      "id": 6,
      "title": "java",
      "body": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible."
    },
    {
      "id": 7,
      "title": "python",
      "body": "Python is an interpreted, high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation."
    },
    {
      "id": 8,
      "title": "c++",
      "body": "C++ is a general-purpose programming language created by Bjarne Stroustrup as an extension of the C programming language."
    },
    {
      "id": 9,
      "title": "ruby",
      "body": "Ruby is a dynamic, open source programming language with a focus on simplicity and productivity."
    },
    {
      "id": 10,
      "title": "go",
      "body": "Go is an open source programming language that makes it easy to build simple, reliable, and efficient software."
    },
    {
      "id": 11,
      "title": "typescript",
      "body": "TypeScript is a strict syntactical superset of JavaScript that adds optional static typing."
    },
    {
      "id": 12,
      "title": "graphql",
      "body": "GraphQL is a query language for APIs and a runtime for executing those queries with your existing data."
    },
    {
      "id": 13,
      "title": "docker",
      "body": "Docker is a set of platform as a service products that use OS-level virtualization to deliver software in packages called containers."
    },
    {
      "id": 14,
      "title": "kubernetes",
      "body": "Kubernetes is an open-source system for automating the deployment, scaling, and management of containerized applications."
    },
    {
      "id": 15,
      "title": "aws",
      "body": "Amazon Web Services (AWS) is a comprehensive cloud computing platform provided by Amazon."
    }
  ]
}
